print('Привіт це программа конвертер валют')
while True:
    print('Оберіть які валюти ви хочете конвертувати')
    print('1:Гривня > Доллар')
    print('2:Гривня > Євро')
    print('3:Доллар > Гривня')
    print('4:Євро > Гривня')
    print('5:Євро > Доллар')
    print('6:Доллар > Євро')

    n = int(input('Ваш вибір: '))

    f = int(input('Введіть яку суму ви бажаєте отримати: '))
    if n == 1:
        print('Ви заплатите: ', f * 38,'грн')
    elif n == 2:
        print('Ви заплатите: ', f * 41.5,'грн')
    elif n == 3:
        print('Ви заплатите: ', f // 37.8,'usd')
    elif n == 4:
        print('Ви заплатите: ', f // 40.8,'eur')
    elif n == 5:
        print('Ви заплатите: ', f // 1.07,'eur')
    elif n == 6:
        print('Ви заплатите: ', f // 0.9,'usd')
    print('Бажаєте продовжити')
    j = int(input('1)Так/2)Ні: '))
    if j == 1:
        continue
    else:
        print('Допобачення')
        break

